menu = {

    'Меню': {
        1: 'Проект',
        2: 'Договор',
        7: 'Список проектов',
        8: 'Список договоров',
        0: 'Завершить работу с программой',
    },

    'Проект': {
        1: 'Создать проект',
        2: 'Добавить договор в проект',
        3: 'Завершить договор выбранного проекта',
        7: 'Список проектов',
        8: 'Список договоров',
        0: 'Вернуться в главное меню',
    },

    'Договор': {
        1: 'Создать договор',
        2: 'Подтвердить договор',
        3: 'Завершить договор',
        7: 'Список проектов',
        8: 'Список договоров',
        0: 'Вернуться в главное меню',
    },
}
